docs/corners/sanity/KBhfunctional_programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-05 Wed 14:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Functional Programming</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Houjun Liu" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>
<link rel="stylesheet" href="https://quantumish.github.io/admonition.css" />

</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Functional Programming</h1> <h2 class="subtitle"></h2> <span class="author">Houjun Liu</span> <span class="date">2022-01-05 Wed 14:57</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul><li><a class='backlink' href='KBhintersession_index.html'>Intersession Index</a></li> </ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#orgab84be9">1. What is FP?</a>
<ul>
<li><a href="#orgc28da7c">1.1. Functional Programming is About Functions</a></li>
<li><a href="#org11bb035">1.2. Some Code Examples</a></li>
</ul>
</li>
<li><a href="#orgdf231a1">2. Builtins</a>
<ul>
<li><a href="#orgbb73c13">2.1. Types to be had</a></li>
<li><a href="#orgc73362e">2.2. Patters</a></li>
</ul>
</li>
<li><a href="#orgea39507">3. Messing with Numbbers</a></li>
<li><a href="#org735abf6">4. Messing with Types!</a>
<ul>
<li><a href="#orgd56b452">4.1. Datatypes</a></li>
<li><a href="#orge782c56">4.2. Recursive Datatypes</a></li>
<li><a href="#org4cd81e0">4.3. Lists</a></li>
<li><a href="#org0633b2f">4.4. Currying</a></li>
<li><a href="#org790dbb8">4.5. Something more difficult</a></li>
</ul>
</li>
<li><a href="#org936168a">5. Operators are functions</a></li>
<li><a href="#org4f35269">6. Libraries</a></li>
<li><a href="#orgca2f3a7">7. Accumulators</a></li>
<li><a href="#org74b6052">8. Write other functions with functions</a>
<ul>
<li><a href="#org4a5264d">8.1. Reduce a tree</a></li>
<li><a href="#orgaa44c67">8.2. Immutable Array</a></li>
</ul>
</li>
</ul>
</div></div>
</div>

<div id="outline-container-orgab84be9" class="outline-2">
<h2 id="orgab84be9"><span class="section-number-2">1</span> What is FP?</h2>
<div class="outline-text-2" id="text-1">
<p>
Computation: taking an instruction, and simplifying it down
</p>
<ul class="org-ul">
<li>\(4+7 = 11\).</li>
<li>\((5-3)*2 = 4\).</li>
</ul>


<p>
We could bind varibles
</p>

<div class="org-src-container">
<pre class="src src-sml">let val x = 3 in x * 5 end
</pre>
</div>

<p>
We could concatenate strings!
</p>

<div class="org-src-container">
<pre class="src src-sml">"Hello" ^ "World!"
</pre>
</div>
</div>


<div id="outline-container-orgc28da7c" class="outline-3">
<h3 id="orgc28da7c"><span class="section-number-3">1.1</span> Functional Programming is About Functions</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Functions are first class citizens
</p>

<div class="org-src-container">
<pre class="src src-sml">let val g = (fn x = x +3) in
g(10)
end
</pre>
</div>

<p>
We could have a piecewise function
</p>

<div class="org-src-container">
<pre class="src src-sml">fn 0 =&gt; true
| x =&gt; false
</pre>
</div>
<p>
g
</p>
<pre class="example">
val it = fn : int -&gt; bool
</pre>


<p>
Or an absolute value function
</p>

<div class="org-src-container">
<pre class="src src-sml">fn x =&gt; if x &gt;= 0 then x else ~1 * x
</pre>
</div>

<p>
Or tuples! As input. Multiple arguments, therefore, is a tuple.
</p>

<div class="org-src-container">
<pre class="src src-sml">val max = fn(x,y) =&gt; if x &gt; y then x else y;
max (12,3)
</pre>
</div>
</div>
</div>

<div id="outline-container-org11bb035" class="outline-3">
<h3 id="org11bb035"><span class="section-number-3">1.2</span> Some Code Examples</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Ok so here's something
</p>

<div class="org-src-container">
<pre class="src src-sml">let val g = fn x = x + 1
in
if "hewo" &gt; g then 1 else false
end 
</pre>
</div>

<p>
This code crashes. Why? \(g: int \to int\), and <code>"hello" &gt; g</code> is a comparing between integer and integer.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdf231a1" class="outline-2">
<h2 id="orgdf231a1"><span class="section-number-2">2</span> Builtins</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgbb73c13" class="outline-3">
<h3 id="orgbb73c13"><span class="section-number-3">2.1</span> Types to be had</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>int</li>
<li>bool</li>
<li>string</li>
<li>a -&gt; b</li>
<li>a * b (this is <b>not</b> a <i>times</i> b, this is a TUPLE between a <i>times</i> b)</li>
</ul>
</div>
</div>

<div id="outline-container-orgc73362e" class="outline-3">
<h3 id="orgc73362e"><span class="section-number-3">2.2</span> Patters</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>x: variable</li>
<li>(p,p,p,p): destructured tuple</li>
<li>_: throwaway</li>
<li>7, "hello": rvalues</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgea39507" class="outline-2">
<h2 id="orgea39507"><span class="section-number-2">3</span> Messing with Numbbers</h2>
<div class="outline-text-2" id="text-3">
<p>
Write a function: check if both args are zero.
</p>

<div class="org-src-container">
<pre class="src src-sml">both_zero = fn (x,y) =&gt; x = y andalso x=0;
</pre>
</div>

<p>
but no! you are bad. you are not thinking like a functional programmer. Instead, the ideomatic way is:
</p>

<div class="org-src-container">
<pre class="src src-sml">val both_zero_better = fn (0,0) =&gt; true
			 | _ =&gt; false;

both_zero_better (0,2)
</pre>
</div>

<p>
Also, this language supports shadowing. In a scope, you could overwrite the value of a variable but its only shadowed.
</p>

<div class="org-src-container">
<pre class="src src-sml">val is_either_zero = fn (0,x) =&gt; 1 | (x,0) =&gt; 1 | _ =&gt; 0;
is_either_zero (0,2);
</pre>
</div>

<p>
Recursion works
</p>

<div class="org-src-container">
<pre class="src src-sml">val rec fact = fn 1 =&gt; 1 | x =&gt; x * fact(x-1);
fact 10
</pre>
</div>

<p>
Write a function that takes an integer, and returns whether or not its a multiple of three.
</p>

<div class="org-src-container">
<pre class="src src-sml">7 div 3
</pre>
</div>

<p>
Divisibility test, slow but "better"
</p>

<div class="org-src-container">
<pre class="src src-sml">val rec threecheck = fn 0 =&gt; true | x =&gt; if x &lt; 0 then false else threecheck (x-3);
threecheck 13
</pre>
</div>

<p>
Written nicely, but the same thing:
</p>

<div class="org-src-container">
<pre class="src src-sml">val rec threecheck = fn 0 =&gt; true | 1 =&gt; false | 2 =&gt; false | x =&gt; threecheck (x - 3);
threecheck 12
</pre>
</div>

<p>
Ok, squaring a number.
</p>

<div class="org-src-container">
<pre class="src src-sml">val rec multi = fn (_,0) =&gt; 0 | (x,1) =&gt; x | (x,y) =&gt; x+multi(x, y-1);
multi (4,8)
</pre>
</div>
</div>
</div>

<div id="outline-container-org735abf6" class="outline-2">
<h2 id="org735abf6"><span class="section-number-2">4</span> Messing with Types!</h2>
<div class="outline-text-2" id="text-4">
<p>
We are going to introduce a new type of declaration
</p>

<p>
<code>type t = types</code>.
</p>

<p>
This is a typedef! Wowzies! But, there's something better.
</p>
</div>

<div id="outline-container-orgd56b452" class="outline-3">
<h3 id="orgd56b452"><span class="section-number-3">4.1</span> Datatypes</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>datatype t = ...</code>
</p>

<p>
What's a datatype? If we have a type A, and some type B, we could put them together.
</p>

<p>
"Type A", "Type B". Type A+B is a type that glues A and B together.
</p>

<p>
For instance, here's a maybe int.
</p>

<div class="org-src-container">
<pre class="src src-sml">datatype intoption = SOME of int | NONE
</pre>
</div>

<p>
Yes, this does exactly what you think it does.
</p>

<div class="org-src-container">
<pre class="src src-sml">datatype intoption = SOME of int | NONE;
SOME 3
</pre>
</div>

<p>
So, here's a function:
</p>

<div class="org-src-container">
<pre class="src src-sml">val zeroout = fn SOME x =&gt; x | NONE =&gt; 0;
zeroout (SOME 43);
</pre>
</div>
</div>
</div>

<div id="outline-container-orge782c56" class="outline-3">
<h3 id="orge782c56"><span class="section-number-3">4.2</span> Recursive Datatypes</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-sml">datatype ilist = EMPTY | FRONT of int*ilist;
val rec length = fn EMPTY =&gt; 0 | FRONT (x, xs) =&gt; 1 + length xs;
</pre>
</div>

<p>
That's a linked list! 
</p>

<p>
Multiply the list together:
</p>

<div class="org-src-container">
<pre class="src src-sml">val rec prod = fn EMPTY =&gt; 1 | FRONT (x, xs) =&gt; x * prod xs;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4cd81e0" class="outline-3">
<h3 id="org4cd81e0"><span class="section-number-3">4.3</span> Lists</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This is a cons list.
</p>

<div class="org-src-container">
<pre class="src src-sml">[1,2,3,4];
</pre>
</div>

<p>
Consing looks like this:
</p>

<div class="org-src-container">
<pre class="src src-sml">4::1::nil
</pre>
</div>
</div>
</div>

<div id="outline-container-org0633b2f" class="outline-3">
<h3 id="org0633b2f"><span class="section-number-3">4.4</span> Currying</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Let's write a function that makes a function!
</p>

<div class="org-src-container">
<pre class="src src-sml">val makeadd = fn x =&gt; (fn y =&gt; y+x);
makeadd 3 7 (* function that adds 3 to 7 *)
</pre>
</div>

<p>
Recursive applications 
</p>

<div class="org-src-container">
<pre class="src src-sml">val uncurry = fn f =&gt; fn (x,y)  =&gt; f x y;
val curry = fn f =&gt; fn x =&gt; fn y =&gt; f (x, y);
</pre>
</div>
</div>
</div>

<div id="outline-container-org790dbb8" class="outline-3">
<h3 id="org790dbb8"><span class="section-number-3">4.5</span> Something more difficult</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-sml">val rec filter = fn f =&gt; fn nil =&gt; nil | x::xs =&gt; if f x then x::filter f xs else filter f xs;
</pre>
</div>

<p>
Let's try something different. We define a list
</p>

<div class="org-src-container">
<pre class="src src-sml">datatype 'a tree = Empty | Node of 'a tree * 'a * 'a tree;
</pre>
</div>

<p>
Let us map over this list.
</p>

<div class="org-src-container">
<pre class="src src-sml">val rec map = fn f =&gt; fn Empty =&gt; Empty | Node (l, x, r) =&gt; Node (map f l, f x, map f r); 
</pre>
</div>

<p>
Check if elements exists in a tree.
</p>

<div class="org-src-container">
<pre class="src src-sml">val rec exists = fn f =&gt; fn Empty =&gt; false | Node (l, x, r) =&gt;  f x orelse exists f l orelse exists f r;
</pre>
</div>


<p>
Write the function in order. turns tree and sort.
</p>
</div>
</div>
</div>

<div id="outline-container-org936168a" class="outline-2">
<h2 id="org936168a"><span class="section-number-2">5</span> Operators are functions</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-sml">(op +) (1,2)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sml">(op ::) (1,nil)
</pre>
</div>

<p>
and etc. etc.
</p>

<p>
We could also compose functions together
</p>

<div class="org-src-container">
<pre class="src src-sml">(f o g)(x) = f(g(x))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f35269" class="outline-2">
<h2 id="org4f35269"><span class="section-number-2">6</span> Libraries</h2>
<div class="outline-text-2" id="text-6">
<p>
Let's open a few libraries with standard implementations we introduced:
</p>

<div class="org-src-container">
<pre class="src src-sml">open Int; 
open Fn;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgca2f3a7" class="outline-2">
<h2 id="orgca2f3a7"><span class="section-number-2">7</span> Accumulators</h2>
<div class="outline-text-2" id="text-7">
<p>
Accumulators allow us to do things that we didn't do previously. For instance, defining, the reverse function:
</p>

<div class="org-src-container">
<pre class="src src-sml">val rec revhelper = fn (nil, acc) =&gt; acc | (x::xs, acc) =&gt; revhelper(xs, acc); 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sml">val rev = fn L =&gt; revhelper(L, nil)
</pre>
</div>

<p>
Direct pattern match!
</p>

<div class="org-src-container">
<pre class="src src-sml">val a = 3;
case a of 3 =&gt; 3 | 4 =&gt; 4 | x =&gt;  x;
</pre>
</div>

<p>
Unit types exists too!
</p>

<div class="org-src-container">
<pre class="src src-sml">();
</pre>
</div>

<p>
There is only one thing in the type Unit: the type information. It does not carry any value.
</p>
</div>
</div>

<div id="outline-container-org74b6052" class="outline-2">
<h2 id="org74b6052"><span class="section-number-2">8</span> Write other functions with functions</h2>
<div class="outline-text-2" id="text-8">
<p>
For instance, let's write map reduce!
</p>

<p>
left reduce:
</p>

<div class="org-src-container">
<pre class="src src-sml">val rec foldl = fn cmb =&gt; fn z =&gt; (fn nil =&gt; z | x::xs =&gt; foldl cmb ( cmb (z, x)) xs);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sml">SOME 3;
</pre>
</div>

<p>
Right reduce
</p>

<div class="org-src-container">
<pre class="src src-sml">val rec foldr = fn cmb =&gt; fn z =&gt; (fn nil =&gt; z | x::xs =&gt; cmb ( x, foldr cmb z xs));
</pre>
</div>


<p>
Therefore, we could write reverse as
</p>

<div class="org-src-container">
<pre class="src src-sml">val rev = foldl op :: []
</pre>
</div>

<p>
Reduce tree:
</p>

<div class="org-src-container">
<pre class="src src-sml">datatype 'a tree = Empty | Node of 'a tree * 'a * 'a tree;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sml">val rec reduce = fn cmb =&gt; fn z =&gt; fn Empty =&gt; z | Node (l,x,r) =&gt; cmb (reduce cmb z l, x, reduce cmb z r);
</pre>
</div>


<p>
Note! If you have infinite cores, and we have perfect parallelism:
</p>

<ul class="org-ul">
<li>Trees scale by depth</li>
<li>Reduce scale by length</li>

<li>Trees: W = O(n), S = O(log n)</li>
<li>Reduce: W = O(n), S = O(n)</li>
</ul>
</div>


<div id="outline-container-org4a5264d" class="outline-3">
<h3 id="org4a5264d"><span class="section-number-3">8.1</span> Reduce a tree</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-sml">val rec helper = fn acc =&gt; fn Empty =&gt; acc | Node (l,x,r) =&gt; helper (x::helper acc r) l;
</pre>
</div>

<ul class="org-ul">
<li>W = O(n)</li>
<li>S = O(n)</li>
</ul>

<p>
Rule of thumb: everything that involves a list is probbaly not very paralizable
</p>

<div class="org-src-container">
<pre class="src src-sml">datatype 'a shrub = Leaf of 'a | Branch of 'a shrub * 'a shrub;
</pre>
</div>

<p>
Shrubs can never be empty! Therefore, we could help optimize a little
</p>
</div>
</div>

<div id="outline-container-orgaa44c67" class="outline-3">
<h3 id="orgaa44c67"><span class="section-number-3">8.2</span> Immutable Array</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-sml">type 'a seq
</pre>
</div>

<p>
We claim that there exists a type alpha seq, and has:
</p>

<ul class="org-ul">
<li>val length: 'a seq -&gt; int</li>
<li>val nth: 'a seq -&gt; int</li>
<li>val tabulate: (int -&gt; 'a) -&gt; int -&gt; 'a seq</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
